tap "adoptopenjdk/openjdk"
tap "cjbassi/gotop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Java build tool
brew "ant"
# Engine for large-scale data processing
brew "apache-spark"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Configurable talking characters in ASCII art
brew "cowsay"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Command-line tool to interact with exercism.io
brew "exercism"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Extremely Fast Compression algorithm
brew "lz4"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Foreman in Go for Procfile-based application management
brew "forego"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Search through your filesystem with SQL-esque queries
brew "fsql"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU typing tutor
brew "gnu-typist"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Post-modern modal text editor
brew "helix"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Static analyzer for Java, C, C++, and Objective-C
brew "infer"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Java-based project management
brew "maven"
# Show markdown documents on text terminals
brew "mdcat"
# Modern and intuitive terminal-based text editor
brew "micro"
# Modern JVM-based framework for building modular microservices
brew "micronaut"
# Terminal-based visual file manager
brew "midnight-commander"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# DNS benchmark utility
brew "namebench"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, highly customisable system info script
brew "neofetch"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Command-line Git information tool
brew "onefetch"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Enable Windows-like alt-tab
cask "alt-tab"
# Opensource IDE for exploring and testing api's
cask "bruno"
cask "font-fantasque-sans-mono"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-ibm-plex"
cask "font-iosevka-nerd-font"
cask "font-monofur-nerd-font"
cask "font-pt-mono"
cask "font-victor-mono"
